import random

def warm_up_activity():
    print("Ας ξεκινήσουμε με μια δραστηριότητα προθέρμασνης!")
    print("Κάντε κάθε ασκήση για 30 δευτερόλεπτα:")
    print("1. Αλματάκια")
    print("2. Ψαλίδια επι τόπου")
    print("3. βήμα άλαμα προς τα επάνω (στατικά)")
    input("Πατήστε Enter όταν είστε έτοιμοι να ξεκινήσετε... ")
    print("Καλή δουλειά! Οι ασκήσεις ζέσταματος ολοκληρώθηκαν.\n")

def quiz_game():
    questions = [
        {
            "question": "Ποια ασκηση βοηθαει στην ενδυνάμωση των κοιλιακών μυών;",
            "options": ["α) Σανίδα", "β) Ημικαθίσματα", "γ) Πιέσεις πάγκου"],
            "answer": "α"
        },
        {
            "question": "Ποιο είναι το κύριο όφελος της αερόβιας άσκησης;",
            "options": ["α) Απώλεια μυικής μάζας", "β) Βελτίωση καρδιαγγειακής υγείας", "γ) Ενδυνάμωση μυών"],
            "answer": "β"
        },
        {
            "question": "Τι σημαίνει το BMI;",
            "options": ["α) Δείκτης μάζας σώματος", "β) Δείκτης μέτρησης σώματος", "γ) Βασικός μεταβολισμός"],
            "answer": "α"
        },
        {
            "question": "Ποιο θρεπτικό συστατικό είναι απαραίτητο για την αναπτυξη και συντήρηση των μυών;",
            "options": ["α) Υδατάνθρακες", "β) Πρωτεΐνες", "γ) Λιπαρά"],
            "answer": "β"
        },
        {
            "question": "Ποια είναι η συνιστώμενη ημερήσια πρόσληψη νερού για ενήλικες σε λίτρα;",
            "options": ["α) 1 λίτρο", "β) 2 λίτρα", "γ) 3 λίτρα"],
            "answer": "β"
        }
    ]

    score = 0
    random.shuffle(questions)
    for q in questions:
        print(q["question"])
        for option in q["options"]:
            print(option)
        user_answer = input("Η απάντησή σας (πληκτρολογήστε το αντίστοιχο γράμμα): ").lower()
        if user_answer == q["answer"]:
            print("Σωστά!\n")
            score += 1
        else:
            print("Λάθος. Η σωστή απάντηση είναι:", q["answer"].upper(), "\n")
    
    print("Ολοκληρώθηκε το κουίζ! Το σκορ σας:", score, "από", len(questions))

def main():
    print("Καλώς ήλθατε στο Κουίζ Φυσικής Αγωγής!")
    print("Ετοιμαστείτε για λίγη διασκέδαση και μάθηση.")
    
    warm_up_activity()
    
    print("Τώρα, ας παίξουμε ένα κουίζ για να δοκιμάσουμε τις γνώσεις σας στη φυσική αγωγή.")
    print("Απαντήστε στις παρακάτω ερωτήσεις πολλαπλής επιλογής. Εισαγάγετε το αντίστοιχο γράμμα.")
    print("Παραδείγματος χάρη, πληκτρολογήστε 'α' για την επιλογή (α). Πατήστε Enter για κάθε απάντηση.\n")
    
    for i in range(1):
        print("Κουίζ", i + 1)
        quiz_game()
        print("\n---\n")

    print("\nΣυγχαρητήρια! Ολοκληρώσατε το κουίζ.")
    print("Θυμηθείτε να παραμένετε δραστήριοι και να κάνετε υγιεινές επιλογές για ένα δυνατό και υγιές σώμα!")

if __name__ == "__main__":
    main()

